Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ЕмайлКонтрагента.ПолучитьОбъект();
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Емайл;
	Элемент.Записать();
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента.ПолучитьОбъект();
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Элемент.Записать();
	
	АдресТип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента.ПолучитьОбъект();
	Элемент.Тип = АдресТип;
	Элемент.Записать();
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента.ПолучитьОбъект();
	Элемент.Тип = АдресТип;
	Элемент.Записать();
	
	Элемент = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента.ПолучитьОбъект();
	Элемент.Тип = АдресТип;
	Элемент.Записать();
	
КонецПроцедуры