
&НаКлиенте
Процедура ПоказыватьПомеченныхНаУдаление(Команда)
	ПоказыватьПомеченныхНаУдаление = Не ПоказыватьПомеченныхНаУдаление;
	Элементы.ФормаПоказыватьПомеченныхНаУдаление.Пометка = ПоказыватьПомеченныхНаУдаление;
	
	ПолеПометкиУдаления = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	НайденныйЭлементОтбора = РаботаСФормамиКлиент.НайтиИлиСоздатьОтборВСписке(Список, ПолеПометкиУдаления);
	
	НайденныйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НайденныйЭлементОтбора.ПравоеЗначение = Ложь;
	НайденныйЭлементОтбора.Использование = Не НайденныйЭлементОтбора.Использование;
	НайденныйЭлементОтбора = Не ПоказыватьПомеченныхНаУдаление;
КонецПроцедуры
