
&НаКлиенте
Процедура СогласованоПриИзменении(Элемент)
	ДоступностьЭлементов(Объект.Согласовано);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДоступностьЭлементов(Объект.Согласовано);
КонецПроцедуры

&НаСервере
Процедура ДоступностьЭлементов(Согласовано)
	Если Согласовано Тогда
		Элементы.Дата.Доступность = Ложь;
		Элементы.Номер.Доступность = Ложь;
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.Цены.Доступность = Ложь;
	Иначе
		Элементы.Дата.Доступность = Истина;
		Элементы.Номер.Доступность = Истина;
		Элементы.Контрагент.Доступность = Истина;
		Элементы.Ответственный.Доступность = Истина;
		Элементы.Комментарий.Доступность = Истина;
		Элементы.Цены.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры
