
&НаКлиенте
Процедура ПересчитатьДокументы(Команда)
	ПересчитатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДокументыНаСервере()
	
	Выборка = Документы.ПоступлениеТоваровИУслуг.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		Поступление = Выборка.ПолучитьОбъект();
		ДатаПоступления = Поступление.Дата;
		
		Если ДатаПоступления > ДатаНачалаПериода И ДатаПоступления < ДатаЗавершенияПериода Тогда
		
			Для Каждого Строка Из Поступление.Товары Цикл
				Строка.Сумма = Строка.Количество * Строка.Цена;
			КонецЦикла;
			
		КонецЕсли;
		
		Поступление.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
