
&НаКлиенте
Процедура ПоказатьПодробныйРасчет(Команда)
	ПоказатьПодробныйРасчет = Не ПоказатьПодробныйРасчет;
	Если ПоказатьПодробныйРасчет Тогда
		Элементы.ТаблицаПремииПоказатьПодробныйРасчет.Заголовок = "Скрыть подробный отчет";
		Элементы.ТаблицаПремииТовары.Видимость = Истина;
		Элементы.ТаблицаПремииУслуги.Видимость = Истина;
	Иначе
		Элементы.ТаблицаПремииПоказатьПодробныйРасчет.Заголовок = "Показать подробный отчет";
		Элементы.ТаблицаПремииТовары.Видимость = Ложь;
		Элементы.ТаблицаПремииУслуги.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура Рассчитать(Команда)
	ТаблицаПремии.Очистить();
	Если ПроверитьЗаполнение() Тогда
		РассчитатьНаСервере();
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	
	ТипТовар = Перечисления.ТипНоменклатуры.Товар;
	ТипУслуга = Перечисления.ТипНоменклатуры.Услуга;
	
	Обороты = РегистрыНакопления.Продажи.Обороты(Период.ДатаНачала, Период.ДатаОкончания);
	
	Для Каждого Строка Из Обороты Цикл
		СтрокаТаблицаПремия = ТаблицаПремии.Добавить();
		СтрокаТаблицаПремия.Сотрудник = Строка.Сотрудник;
		Если Строка.Номенклатура.ТипНоменклатуры = ТипТовар Тогда
			СтрокаТаблицаПремия.СуммаПродажТоваров = Строка.Сумма;
			СтрокаТаблицаПремия.НачисленоЗаПродажуТоваров = Строка.Сумма * ПроцентПремииЗаПродажуТоваров / 100;
			СтрокаТаблицаПремия.Премия = Строка.Сумма * ПроцентПремииЗаПродажуТоваров / 100;
		КонецЕсли;
		Если Строка.Номенклатура.ТипНоменклатуры = ТипУслуга Тогда
			СтрокаТаблицаПремия.СуммаПродажУслуг = Строка.Сумма;
			СтрокаТаблицаПремия.НачисленоЗаПродажуУслуг = Строка.Сумма * ПроцентПремииЗаПродажуУслуг / 100;
			СтрокаТаблицаПремия.Премия = Строка.Сумма * ПроцентПремииЗаПродажуУслуг / 100;
		КонецЕсли;
	КонецЦикла;
	
	Свернутая = ТаблицаПремии.Выгрузить();
	Свернутая.Свернуть("Сотрудник", "СуммаПродажТоваров, СуммаПродажУслуг, НачисленоЗаПродажуТоваров, НачисленоЗаПродажуУслуг, Премия");
	ТаблицаПремии.Загрузить(Свернутая);
		
КонецПроцедуры











