Функция ИННВерен(ИНН) Экспорт
	
	ДлинаИНН = СтрДлина(ИНН);
	Если ДлинаИНН = 12 Тогда
		Возврат Истина;
	КонецЕсли;
 	Если ДлинаИНН = 10 Тогда
		КонтрольнаяСумма = 0;
		Множители = СтрРазделить("2, 4, 10, 3, 5, 9, 4, 6, 8", " ,", Ложь);
		Для Сч = 0 По 8 Цикл
			ЦифраИНН = Число(Сред(ИНН, Сч + 1, 1));
			КонтрольнаяСумма = КонтрольнаяСумма + ЦифраИНН * Число(Множители[Сч]);
		КонецЦикла;
		Возврат ?(КонтрольнаяСумма % 11 % 10 = Число(Прав(ИНН, 1)), Истина, Ложь);
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции