
&НаКлиенте
Процедура ВосстановитьГраницу(Команда)
	ВосстановитьГраницуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьГраницуНаСервере()
	Последовательности.СкладскиеТовары.Восстановить();;
	ПрочитатьГраницуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьГраницу(Команда)
	ПрочитатьГраницуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьГраницуНаСервере()
	Граница = Последовательности.СкладскиеТовары.ПолучитьГраницу();
	ГраницаДата = Граница.Дата;
	ГраницаСсылка = Граница.Ссылка;
КонецПроцедуры
