
&НаКлиенте
Процедура ОК(Команда)
	Выбранные = Новый Массив;
	Для Каждого ВыбранныйЭлемент Из СписокВыбранныхЭлементов Цикл
		ОписаниеВыбранногоЗначения = Новый Структура("Номенклатура, Количество");
		ЗаполнитьЗначенияСвойств(ОписаниеВыбранногоЗначения, ВыбранныйЭлемент);
		Выбранные.Добавить(ОписаниеВыбранногоЗначения);
	КонецЦикла;
	ОповеститьОВыборе(Выбранные);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Номенклатура", Значение);
	НайденныеСтрокиВСпискеВыбранных = СписокВыбранныхЭлементов.НайтиСтроки(Отбор);
	Если НайденныеСтрокиВСпискеВыбранных.Количество() = 0 Тогда
		НоваяСтрока = СписокВыбранныхЭлементов.Добавить();
		НоваяСтрока.Номенклатура = Значение;
		НоваяСтрока.Количество = 1
	Иначе
		НайденнаяСтрока = НайденныеСтрокиВСпискеВыбранных[0];
		НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + 1 
	КонецЕсли;
КонецПроцедуры


