Процедура ОбработкаПроведения(Отказ,Режим)
	
	Найденные = Новый Массив;
	ТаблицаЦены = Цены.Выгрузить();
	Для Каждого Строка Из ТаблицаЦены Цикл
		Если Найденные.Найти(Строка.Номенклатура) = Неопределено Тогда
			Найденные.Добавить(Строка.Номенклатура);
		Иначе
			Отказ = Истина;
			Сообщить("Присутствуют строки с одинаковой номенклатурой")
		КонецЕсли;
	КонецЦикла;

	Движения.ЦеныПоставщиков.Записывать = Истина;
	Для Каждого ТекСтрокаЦены из Цены Цикл
		Движение = Движения.ЦеныПоставщиков.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
		Движение.Контрагент = Контрагент;
		Движение.Цена = ТекСтрокаЦены.Цена;
		Движение.Ответственный = Ответственный;
	КонецЦикла;

КонецПроцедуры
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если не Согласовано Тогда
		Отказ = Истина;
		Сообщить("Необходимо согласовать документ");
	КонецЕсли;
КонецПроцедуры


