
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтоЮридическоеЛицо = ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ДлинаИНН = СтрДлина(ИНН);
	ДлинаКПП = СтрДлина(КПП);
		
	Если ЭтоЮридическоеЛицо Тогда
		Если НЕ ЗначениеЗаполнено(ИНН) Тогда  
			Отказ = Истина;
			Сообщить("Не заполнено поле ""ИНН""");
		Иначе
			Если ДлинаИНН <> 10 Тогда
				Отказ = Истина;
				Сообщить("Номер ИНН должен состоять из 10 цифр");
			Иначе 
				Если Не РаботаСИНН.ИННВерен(ИНН) Тогда
					Отказ = Истина;
					Сообщить("Контрольная сумма ИНН не совпадает");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;    
		
		Если НЕ ЗначениеЗаполнено(КПП) Тогда  
			Отказ = Истина;
			Сообщить("Не заполнено поле ""КПП""");
		Иначе
			Если ДлинаКПП <> 9 Тогда
				Отказ = Истина;
				Сообщить("Номер КПП должен состоять из 9 цифр");
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(ИНН) Тогда  
			Отказ = Истина;
			Сообщить("Не заполнено поле ""ИНН""");
		Иначе
			Если ДлинаИНН <> 12 Тогда
				Отказ = Истина;
				Сообщить("Номер ИНН должен состоять из 12 цифр");
			Иначе 
				Если Не РаботаСИНН.ИННВерен(ИНН) Тогда
					Отказ = Истина;
					Сообщить("Контрольная сумма ИНН не совпадает");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(КПП) Тогда    
			Отказ = Истина;
			Сообщить("Для физического лица поле ""КПП"" не должно быть заполнено");
		КонецЕсли;
	КонецЕсли;
	
	Цифры = "01234567890";
	Для Сч = 1 По ДлинаИНН Цикл
		Символ = Сред(ИНН, Сч, 1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Отказ = Истина; 
			Сообщить("Номер ИНН содержит недопустимые символы");  
			Прервать;
		КонецЕсли;  
	КонецЦикла;   
	
	Для Сч = 1 По ДлинаКПП Цикл
		Символ = Сред(КПП, Сч, 1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Отказ = Истина; 
			Сообщить("Номер КПП содержит недопустимые символы");  
			Прервать;
		КонецЕсли;  
	КонецЦикла;
	
КонецПроцедуры
