Процедура ОбработкаПроведения(Отказ,Режим)
	
	ТаблицаТовары = Товары.Выгрузить();
	ТаблицаТовары.Свернуть("Номенклатура", "Количество, Сумма");
	
	Движения.Товары.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из ТаблицаТовары Цикл
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сотрудник = Ответственный;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		
		Если ТекСтрокаТовары.Номенклатура.ТипНоменклатуры = Перечисления.ТипНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.Товары.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры


