Процедура ПриНачалеРаботыСистемы() Экспорт
	
	НоваяВерсия = Метаданные.Версия;
	СтараяВерсия = Константы.ВерсияКонфигурации.Получить();
	
	Если СтараяВерсия = НоваяВерсия Тогда
		Возврат;
	Иначе
		ПриИзмененииВерсии(СтараяВерсия, НоваяВерсия);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииВерсии(СтараяВерсия, НоваяВерсия)
	
	УстанавливаемаяВерсия = "1.0.0.1";
	 
	Если СтараяВерсия < УстанавливаемаяВерсия И НоваяВерсия >= УстанавливаемаяВерсия Тогда
		Справочники.ВидыКонтактнойИнформации.ЗаполнитьПредопределенныеЭлементы();
	КонецЕсли;
	
	УстанавливаемаяВерсия = "1.0.0.2";
	 
	Если СтараяВерсия < УстанавливаемаяВерсия И НоваяВерсия >= УстанавливаемаяВерсия Тогда
		Справочники.Контрагенты.ЗаполнитьТабличнуюЧастьКонтактнаяИнформацция();
	КонецЕсли;
	
	Константы.ВерсияКонфигурации.Установить(НоваяВерсия);
КонецПроцедуры