
&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Отбор = Новый Структура("Номенклатура", ВыбранноеЗначение);
	Найденные = СписокНоменклатуры.НайтиСтроки(Отбор);
	Если Найденные.Количество() = 0 Тогда
		НоваяСтрока = СписокНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.СписокНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаАктуальности = ТекущаяДата();
	УстановитьВариантУстановки();
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьЦенуНасервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьЦенуНасервере()
	ТаблицаЗначений = СписокНоменклатуры.Выгрузить();
	ВсяНоменклатура = Новый Массив;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		ДобавитьКНоменклатуре(Строка.Номенклатура, ВсяНоменклатура);
	КонецЦикла;
	
	Если ВариантУстановки = 0 Тогда
		УстановитьФиксированнуюЦенуНаСервере(ВсяНоменклатура);
	ИначеЕсли ВариантУстановки = 1 Тогда
		УдалитьЦеныНаСервере(ВсяНоменклатура);
	ИначеЕсли ВариантУстановки = 2 Тогда
		ПакетноеИзменениеЦенНаСервере(ВсяНоменклатура);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьКНоменклатуре(Номенклатура, ВсяНоменклатура)
	Если Номенклатура.ЭтоГруппа = Истина Тогда
		Выборка = Справочники.Номенклатура.Выбрать(Номенклатура);
		Пока Выборка.Следующий() Цикл
			ДобавитьКНоменклатуре(Выборка.Ссылка, ВсяНоменклатура);
		КонецЦикла;
	Иначе
		ВсяНоменклатура.Добавить(Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантУстановкиПриИзменении(Элемент)
	УстановитьВариантУстановки();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВариантУстановки()
	Элементы.ФиксированнаяЦена.Доступность = (ВариантУстановки = 0);
	Элементы.ПроцентОтТекущейЦены.Доступность = (ВариантУстановки = 2);
	Элементы.ДатаАктуальности.Доступность = (ВариантУстановки = 2);
КонецПроцедуры

&НаСервере
Процедура УстановитьФиксированнуюЦенуНаСервере(ВсяНоменклатура)
	Для Каждого Номенклатура Из ВсяНоменклатура Цикл
		МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатура.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Цена = ФиксированнаяЦена;
		МенеджерЗаписи.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьЦеныНаСервере(ВсяНоменклатура)
	
	Для Каждого Номенклатура Из ВсяНоменклатура Цикл
		НаборЗаписей = РегистрыСведений.ЦеныПродажиНоменклатура.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПакетноеИзменениеЦенНаСервере(ВсяНоменклатура) 
	
	Для Каждого Номенклатура Из ВсяНоменклатура Цикл
		НаборЗаписей = РегистрыСведений.ЦеныПродажиНоменклатура.СоздатьНаборЗаписей();
		ПоследняяЦена = ПолучитьПоследнююЦенуНоменклатуры(Номенклатура);
		Запись = НаборЗаписей.Добавить();
		Запись.Номенклатура = Номенклатура;
		Запись.Период = ТекущаяДата();
		Запись.Цена = ПоследняяЦена + ПоследняяЦена * ПроцентОтТекущейЦены / 100;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПоследнююЦенуНоменклатуры(Номенклатура)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	ПоследняяЦена = РегистрыСведений.ЦеныПродажиНоменклатура.ПолучитьПоследнее(ДатаАктуальности, Отбор);
	Возврат ПоследняяЦена.Цена;
	
КонецФункции


















