
Процедура ПриНачалеРаботыСистемы()
	
	ПроверитьСегодняПраздник();	
	ПроверитьСегодняДеньРождения();
	ОбновлениеИнформационнойБазыВызовСервера.ПриНачалеРаботыСистемы();
	
КонецПроцедуры

Процедура ПроверитьСегодняПраздник()
	
	Сообщить("Приложение на платформе 1С:Предприятия 8 готово к работе");   
	
	Праздники = Новый Массив;
	Праздники.Добавить(Новый Структура("День, Месяц, Название", 1, 1, "Новый год"));
	Праздники.Добавить(Новый Структура("День, Месяц, название", 8, 3, "8 марта"));
	Праздники.Добавить(Новый Структура("День, Месяц, название", 7, 5, "День радио"));
	
	Сегодня = ТекущаяДата();
	Завтра = ТекущаяДата() + 86400;
	
	Для Каждого Праздник Из Праздники Цикл	
		Если Праздник.Месяц = Месяц(Сегодня) И Праздник.День = День(Сегодня) Тогда
			Сообщить(СтрШаблон("Поздравляем! Сегодня %1", Праздник.Название));
		КонецЕсли;
		Если Праздник.Месяц = Месяц(Завтра) И Праздник.День = День(Завтра) Тогда
			Сообщить(СтрШаблон("Завтра %1", Праздник.Название));
		КонецЕсли; 
	КонецЦикла;

	
КонецПроцедуры

Процедура ПроверитьСегодняДеньРождения()
	
	Сегодня = ТекущаяДата();
	ДеньРождения = СотрудникиВызовСервера.ДеньРожденияТекущегоПользователя();
	Если Месяц(Сегодня) = Месяц(ДеньРождения) И  День(ДеньРождения) = День(Сегодня) Тогда
		Сообщить("С днем рождения!");
	КонецЕсли;
	
КонецПроцедуры