
&НаКлиенте
Процедура СписокКонтактныхЛиц(Команда)
	СписокКонтактныхЛицНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокКонтактныхЛицНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Код) Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Справочники.КонтактныеЛица.Выбрать(, Объект.Ссылка, , );
	Пока Выборка.Следующий() Цикл
		Сообщить(СтрШаблон("Имя контактного лица: %1," + Символы.ПС + "Должность: %2," + Символы.ПС +  "Телефон: %3", Выборка.Наименование, Выборка.Должность, Выборка.Телефон));
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.ПолноеНаименование = Объект.Наименование;
КонецПроцедуры
